Финансы/src/Documents/ПланированиеДоходовИРасходов/ПланированиеДоходовИРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланированиеДоходовИРасходов</name>
  <registerRecords>InformationRegister.ПлановыеДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>ВариантБюджета</name>
    <type>
      <types>CatalogRef.ВариантыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаБюджета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Месяц01</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц02</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц03</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц04</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц05</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц06</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц07</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц08</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц09</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц10</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц11</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц12</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планирование</name>
    <attributes>
      <name>СтатьяДоходовИРасходов</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма01</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма02</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма03</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма04</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма05</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма06</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма07</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма08</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма09</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Финансы/src/AccumulationRegisters/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияДенежныхСредств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаПрихода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаДвижения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоРасходовДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаРасходовДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Финансы/src/Documents/ПланированиеДоходовИРасходов/Forms/ФормаДокумента1/Module.bsl
&НаСервереБезКонтекста
Функция МесяцСтрокой(НачальнаяДата, КолвоМесяцев)
	
	Возврат Формат(ДобавитьМесяц(НачалоМесяца(НачальнаяДата), КолвоМесяцев - 1), "ДФ='MMMM yyyy'");
	
КонецФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	
	Для НомерМесяца = 1 По 12 Цикл
		СтрокаНомерМесяца = Формат(НомерМесяца, "ЧЦ=2; ЧДЦ=0; ЧВН=");
		Элементы["ПланированиеСумма"+СтрокаНомерМесяца].Видимость = Объект["Месяц"+СтрокаНомерМесяца];
		Элементы["ПланированиеСумма"+СтрокаНомерМесяца].Заголовок = МесяцСтрокой(Объект.НачальнаяДатаПланирования, НомерМесяца);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачальнаяДатаПланированияПриИзменении(Элемент)
	Объект.НачальнаяДатаПланирования = НачалоМесяца(Объект.НачальнаяДатаПланирования);
КонецПроцедуры

&НаКлиенте
Процедура НачальнаяДатаПланированияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.НачальнаяДатаПланирования = ДобавитьМесяц(Объект.НачальнаяДатаПланирования, Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФлагаМесяца(Элемент)
	
	НомерИзменяемогоСтолбца = Число(Прав(Элемент.Имя,2));
	
	Для НомерМесяца = 1 По НомерИзменяемогоСтолбца Цикл
		Объект["Месяц"+Формат(НомерМесяца, "ЧЦ=2; ЧДЦ=0; ЧВН=")] = Истина;
	КонецЦикла;
	
	Для НомерМесяца = НомерИзменяемогоСтолбца + 1 По 12 Цикл
		Объект["Месяц"+Формат(НомерМесяца, "ЧЦ=2; ЧДЦ=0; ЧВН=")] = Ложь;
	КонецЦикла;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтатьи(Команда)
	
	Если Объект.Планирование.Количество() <> 0 Тогда
		
		Если Вопрос("В документе уже есть данные для планирования. Все равно очистить документ?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьСтатьиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьиНаСервере()
	
	Объект.Планирование.Очистить();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвиженияДенежныхСредствОбороты.СтатьяДоходовРасходов.Родитель КАК СтатьяДоходовРасходовРодитель,
		|	СУММА(ДвиженияДенежныхСредствОбороты.СуммаРасходаОборот) КАК СуммаРасходаОборот
		|ИЗ
		|	РегистрНакопления.ДвиженияДенежныхСредств.Обороты(&Дата1, &Дата2, , ВалютаДвижения = &Рубль) КАК ДвиженияДенежныхСредствОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвиженияДенежныхСредствОбороты.СтатьяДоходовРасходов.Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтатьяДоходовРасходовРодитель
		|АВТОУПОРЯДОЧИВАНИЕ";

	Запрос.УстановитьПараметр("Дата1", ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -3));
	Запрос.УстановитьПараметр("Дата2", НачалоМесяца(ТекущаяДата()) - 1);
	Запрос.УстановитьПараметр("Рубль", Константы.ОсновнаяВалютаУчета.Получить());

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НС = Объект.Планирование.Добавить();
		НС.СтатьяДоходовИРасходов = ВыборкаДетальныеЗаписи.СтатьяДоходовРасходовРодитель;
		
		Для НомерМесяца = 1 По 12 Цикл
			СтрокаНомерМесяца = Формат(НомерМесяца, "ЧЦ=2; ЧДЦ=0; ЧВН=");
			Если Объект["Месяц"+СтрокаНомерМесяца] Тогда
				НС["Сумма"+СтрокаНомерМесяца] = ВыборкаДетальныеЗаписи.СуммаРасходаОборот;
			Иначе
				НС["Сумма"+СтрокаНомерМесяца] = 0;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
